namespace Rtippo6Sivkov.Models;

public class AppUserRole
{
    public int Id { get; set; }
    public string Name { get; set; } = null!;

    public List<AppUser> UsersWithRole { get; set; } = null!;
}

public static class AppUserExtensions
{
    /// <summary>
    /// Проверка прав пользователей. Имеет ли право данная роль искать и просматривать записи реестра организаций
    /// в данном муниципальном образовании?
    /// </summary>
    /// <param name="user">Пользователь, у которого проверяют права.</param>
    /// <param name="locality">Муниципальное образование, доступ к которому нужно проверить у данной роли.</param>
    /// <returns>true, если имеет право; false, если не имеет.</returns>
    public static bool CanReadRegistryEntries(this AppUser user, Locality locality)
    {
        return user.Role.Name.ToLower() switch
        {
            // Доступ для поиска и просмотра в рамках всех записей реестра
            "куратор ветслужбы"
                or "куратор по отлову"
                or "куратор приюта"
                or "подписант ветслужбы"
                or "подписант по отлову"
                or "подписант приюта" => true,

            // Доступ для поиска и просмотра в рамках записей, относящихся к соответствующему муниципальному образованию
            "куратор омсу"
                or "подписант омсу" => user.Locality.Id == locality.Id,

            // Доступ для ведения в части типов:
            // - Исполнительный орган государственной власти;
            // - Орган местного самоуправления;
            // - Ветеринарная клиника: государственная
            "оператор ветслужбы" => user.Locality.Name.ToLower() is
                "исполнительный орган государственной власти"
                or "орган местного самоуправления"
                or "ветеринарная клиника: государственная",

            // Доступ для ведения в рамках записей, относящихся к соответствующему муниципальному образованию, в составе следующих типов:
            // - Приют;
            // - Организация по отлову;
            // - Организация по отлову и приют;
            // - Организация по транспортировке;
            // - Ветеринарная клиника: государственная;
            // - Ветеринарная клиника: частная;
            // - Благотворительный фонд;
            // - Организации по продаже товаров и предоставлению услуг для животных
            "оператор омсу" => user.Locality.Name.ToLower() is
                "приют"
                or "организация по отлову"
                or "организация по отлову и приют"
                or "организация по транспортировке"
                or "ветеринарная клиника: государственная"
                or "ветеринарная клиника: частная"
                or "благотворительный фонд"
                or "организации по продаже товаров и предоставлению услуг для животных",
            
            _ => throw new Exception($"Неизвестная роль: {user.Role.Name}")
        };
    }

    /// <summary>
    /// Проверка прав пользователей. Имеет ли право данная роль изменять и добавлять записи реестра организаций
    /// в данном муниципальном образовании?
    /// </summary>
    /// <param name="user">Пользователь, у которого проверяют права.</param>
    /// <param name="locality">Муниципальное образование, доступ к которому нужно проверить у данной роли.</param>
    /// <returns>true, если имеет право; false, если не имеет.</returns>
    public static bool CanCreateOrEditRegistryEntries(this AppUser user, Locality locality)
    {
        return user.Role.Name.ToLower() switch
        {
            // Доступ для поиска и просмотра в рамках всех записей реестра
            "куратор ветслужбы"
                or "куратор по отлову"
                or "куратор приюта"
                or "подписант ветслужбы"
                or "подписант по отлову"
                or "подписант приюта" => false,

            // Доступ для поиска и просмотра в рамках записей, относящихся к соответствующему муниципальному образованию
            "куратор омсу"
                or "подписант омсу" => false,

            // Доступ для ведения в части типов:
            // - Исполнительный орган государственной власти;
            // - Орган местного самоуправления;
            // - Ветеринарная клиника: государственная
            "оператор ветслужбы" => user.Locality.Name.ToLower() is
                "исполнительный орган государственной власти"
                or "орган местного самоуправления"
                or "ветеринарная клиника: государственная",

            // Доступ для ведения в рамках записей, относящихся к соответствующему муниципальному образованию, в составе следующих типов:
            // - Приют;
            // - Организация по отлову;
            // - Организация по отлову и приют;
            // - Организация по транспортировке;
            // - Ветеринарная клиника: государственная;
            // - Ветеринарная клиника: частная;
            // - Благотворительный фонд;
            // - Организации по продаже товаров и предоставлению услуг для животных
            "оператор омсу" => user.Locality.Id == locality.Id && user.Locality.Name.ToLower() is
                "приют"
                or "организация по отлову"
                or "организация по отлову и приют"
                or "организация по транспортировке"
                or "ветеринарная клиника: государственная"
                or "ветеринарная клиника: частная"
                or "благотворительный фонд"
                or "организации по продаже товаров и предоставлению услуг для животных",
            
            _ => throw new Exception($"Неизвестная роль: {user.Role.Name}")
        };
    }
}